from .our_task_info import dataset_info_dict_1, dataset_info_dict_2

task_prompt_dict_v1 = {
            "1_1": {"task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت کاربر در مکالمه با چت بات",
                    "task_classes": ["عالی", "خوب", "متوسط", "بد", "خیلی بد"]},
            "1_2": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر در مکالمه با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_3": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن چت بات در مکالمه ی کاربر با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_4": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عصبانیت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_5": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_6": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس صمیمیت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_7": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس ترس کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_8": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس حسادت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_9": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس شگفتی کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_10": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عشق کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_11": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس غصه کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_12": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس خوشحالی کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_13": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر",
                "task_classes": ["عامیانه", "رسمی", "کودکانه", "ادبی"]},
            "1_14": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["بازی ویدیویی", "راهنمای خرید", "سلامت و زیبایی", "علم و تکنولوژی", "عمومی",
                                 "هنر و سینما", "کتاب و ادبیات"]},
            "1_15": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["پزشکی", "کشاورزی و منابع طبیعی", "فنی مهندسی",
                                 "علوم پایه", "علوم انسانی", "هنر و معماری", "علمی تخصصی", "دامپزشکی"]},
            "1_16": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["هنر و طراحی", "مسائل اجتماعی و فعال‌سازی", "الهام‌بخش و انگیزشی", "خودرو",
                                 "زیبایی و لوازم آرایشی", "غذا و آشپزی", "کسب و کار و مالی", "مد و سبک",
                                 "آموزش و یادگیری", "علم و کشف", "بازی", "فناوری و نوآوری", "مذهب و معنویت",
                                 "حیوانات خانگی و جانوران", "سفر و ماجراجویی", "خانواده و پرورش فرزند",
                                 "خنده‌دار و طنز", "سلامت و بهزیستی", "خانه و باغ", "سیاست و مسائل روز",
                                 "تفریحات و فرهنگ عامه", "ورزش و ورزشکاری", "آب و هوا و فصول", "کتاب‌ها و ادبیات",
                                 "محیط زیست و پایداری"]},
            "1_17": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["موسیقی", "تقویم", "هشدار", "آب‌وهوا", "پخش", "تاریخ و زمان", "آشپزی", "ایمیل",
                                 "بیرون‌بر", "اخبار", "پیشنهاد", "فهرست‌ها", "اجتماعی", "حمل‌ونقل", "عمومی",
                                 "پرسش و پاسخ", "صوتی", "اینترنت اشیاء"]},
            "1_18": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی احساس متن",
                "task_classes": ["شادی", "غم", "خشم", "انزجار", "ترس", "تعجب"]},
            "1_19": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی", "خنثی"]},

            "1_20": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر در مکالمه با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "1_21": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن چت بات در مکالمه ی کاربر با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "2_1": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن اول مکالمه ی کاربر با چت بات به همراه پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_2": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آیا متن دوم کلمات کلیدی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_3": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آیا متن دوم پاسخ متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_4": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم متفاوت در موضوع یکسان", "مفهوم کاملا متفاوت"]},
            "2_5": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم تا حدی متفاوت با جزئیات یکسان", "مفهوم متفاوت در موضوع یکسان",
                                 "مفهوم کاملا متفاوت"]},
            "2_6": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مشابه", "متضاد", "بی ارتباط"]},
            "2_7": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم بازنویسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_8": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , احساس رضایت از نظر متن دوم در متن اول چگونه است ؟",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "2_9": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی فارسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_10": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی عربی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_11": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی انگلیسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_12": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن دوم که یک موجودیت نامدار در متن اول است به کدام دسته تعلق دارد ؟",
                "task_classes": ["گروه‌های سیاسی", "اشخاص", "سازمان‌ها", "مکان‌ها", "رویدادها", "ملت‌ها"]},
            "2_13": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن دوم که یک موجودیت نامدار در متن اول است به کدام دسته تعلق دارد ؟",
                "task_classes": ["اشخاص", "سازمان‌ها", "مکان‌ها"]},
            "3_1": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_2": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم موضوعات استخراج شده ی متن اول است ؟",
                "task_classes": None},
            "3_3": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات به همراه پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": None},
            "3_4": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم کلمات کلیدی متن اول است ؟",
                "task_classes": None},
            "3_5": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم پاسخ متن اول است ؟",
                "task_classes": None},
            "3_6": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم شباهت معنایی با متن اول دارد ؟",
                "task_classes": None},
            "3_7": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_8": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم بازنویسی متن اول است ؟",
                "task_classes": None},
            "3_9": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی فارسی متن اول است ؟",
                "task_classes": None},
            "3_10": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی عربی متن اول است ؟",
                "task_classes": None},
            "3_11": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی انگلیسی متن اول است ؟",
                "task_classes": None},
            "3_12": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول یک مکالمه است. آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "1_170": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": []},
            "1_190": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی"]},
            "3_30": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول  پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": None},
}

task_prompt_dict_v2 = {
            "1_1": {"task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت کاربر در مکالمه با چت بات",
                    "task_classes": ["عالی", "خوب", "متوسط", "بد", "خیلی بد"]},
            "1_2": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر در مکالمه با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_3": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن چت بات در مکالمه ی کاربر با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_4": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عصبانیت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_5": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_6": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس صمیمیت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_7": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس ترس کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_8": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس حسادت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_9": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس شگفتی کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_10": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عشق کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_11": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس غصه کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_12": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس خوشحالی کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_13": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن متن",
                "task_classes": ["عامیانه", "رسمی", "کودکانه", "ادبی"]},
            "1_14": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["بازی ویدیویی", "راهنمای خرید", "سلامت و زیبایی", "علم و تکنولوژی", "عمومی",
                                 "هنر و سینما", "کتاب و ادبیات"]},
            "1_15": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["پزشکی", "کشاورزی و منابع طبیعی", "فنی مهندسی",
                                 "علوم پایه", "علوم انسانی", "هنر و معماری", "علمی تخصصی", "دامپزشکی"]},
            "1_16": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["هنر و طراحی", "مسائل اجتماعی و فعال‌سازی", "الهام‌بخش و انگیزشی", "خودرو",
                                 "زیبایی و لوازم آرایشی", "غذا و آشپزی", "کسب و کار و مالی", "مد و سبک",
                                 "آموزش و یادگیری", "علم و کشف", "بازی", "فناوری و نوآوری", "مذهب و معنویت",
                                 "حیوانات خانگی و جانوران", "سفر و ماجراجویی", "خانواده و پرورش فرزند",
                                 "خنده‌دار و طنز", "سلامت و بهزیستی", "خانه و باغ", "سیاست و مسائل روز",
                                 "تفریحات و فرهنگ عامه", "ورزش و ورزشکاری", "آب و هوا و فصول", "کتاب‌ها و ادبیات",
                                 "محیط زیست و پایداری"]},
            "1_17": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["موسیقی", "تقویم", "هشدار", "آب‌وهوا", "پخش", "تاریخ و زمان", "آشپزی", "ایمیل",
                                 "بیرون‌بر", "اخبار", "پیشنهاد", "فهرست‌ها", "اجتماعی", "حمل‌ونقل", "عمومی",
                                 "پرسش و پاسخ", "صوتی", "اینترنت اشیاء"]},
            "1_18": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی احساس متن",
                "task_classes": ["شادی", "غم", "خشم", "انزجار", "ترس", "تعجب"]},
            "1_19": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "1_20": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر در مکالمه با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "1_21": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن چت بات در مکالمه ی کاربر با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "2_1": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن اول مکالمه ی کاربر با چت بات به همراه پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_2": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آیا متن دوم کلمات کلیدی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_3": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آیا متن دوم پاسخ متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_4": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم متفاوت در موضوع یکسان", "مفهوم کاملا متفاوت"]},
            "2_5": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم تا حدی متفاوت با جزئیات یکسان", "مفهوم متفاوت در موضوع یکسان",
                                 "مفهوم کاملا متفاوت"]},
            "2_6": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مشابه", "متضاد", "بی ارتباط"]},
            "2_7": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم بازنویسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_8": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , احساس رضایت از نظر متن دوم در متن اول چگونه است ؟",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "2_9": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی فارسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_10": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی عربی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_11": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی انگلیسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_12": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن دوم که یک موجودیت نامدار در متن اول است به کدام دسته تعلق دارد ؟",
                "task_classes": ["گروه‌های سیاسی", "اشخاص", "سازمان‌ها", "مکان‌ها", "رویدادها", "ملت‌ها"]},
            "2_13": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن دوم که یک موجودیت نامدار در متن اول است به کدام دسته تعلق دارد ؟",
                "task_classes": ["اشخاص", "سازمان‌ها", "مکان‌ها"]},
            "3_1": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_2": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم موضوعات استخراج شده ی متن اول است ؟",
                "task_classes": None},
            "3_3": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات به همراه پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": None},
            "3_4": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم کلمات کلیدی متن اول است ؟",
                "task_classes": None},
            "3_5": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم پاسخ متن اول است ؟",
                "task_classes": None},
            "3_6": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم شباهت معنایی با متن اول دارد ؟",
                "task_classes": None},
            "3_7": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_8": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم بازنویسی متن اول است ؟",
                "task_classes": None},
            "3_9": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی فارسی متن اول است ؟",
                "task_classes": None},
            "3_10": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی عربی متن اول است ؟",
                "task_classes": None},
            "3_11": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی انگلیسی متن اول است ؟",
                "task_classes": None},
            "3_12": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول یک مکالمه است. آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_13": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم به متن اول مرتبط است ؟",
                "task_classes": None},
            "3_14": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم موضوع استخراج شده ی متن اول است ؟",
                "task_classes": None},

            "1_170": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": []},
            "1_190": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی"]},
            "3_30": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول  پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": None},
        }




task_prompt_dict_v3 = {
            "1_1": {"task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت کاربر در مکالمه با چت بات",
                    "task_classes": ["عالی", "خوب", "متوسط", "بد", "خیلی بد"]},
            "1_2": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر در مکالمه با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_3": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن چت بات در مکالمه ی کاربر با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_4": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عصبانیت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_5": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_6": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس صمیمیت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_7": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس ترس کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_8": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس حسادت کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_9": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس شگفتی کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_10": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عشق کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_11": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس غصه کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_12": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس خوشحالی کاربر در مکالمه با چت بات",
                "task_classes": ["مثبت", "منفی"]},
            "1_13": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن متن",
                "task_classes": ["عامیانه", "رسمی", "کودکانه", "ادبی"]},
            "1_14": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["بازی ویدیویی", "راهنمای خرید", "سلامت و زیبایی", "علم و تکنولوژی", "عمومی",
                                 "هنر و سینما", "کتاب و ادبیات"]},
            "1_15": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["پزشکی", "کشاورزی و منابع طبیعی", "فنی مهندسی",
                                 "علوم پایه", "علوم انسانی", "هنر و معماری", "علمی تخصصی", "دامپزشکی"]},
            "1_16": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["هنر و طراحی", "مسائل اجتماعی و فعال‌سازی", "الهام‌بخش و انگیزشی", "خودرو",
                                 "زیبایی و لوازم آرایشی", "غذا و آشپزی", "کسب و کار و مالی", "مد و سبک",
                                 "آموزش و یادگیری", "علم و کشف", "بازی", "فناوری و نوآوری", "مذهب و معنویت",
                                 "حیوانات خانگی و جانوران", "سفر و ماجراجویی", "خانواده و پرورش فرزند",
                                 "خنده‌دار و طنز", "سلامت و بهزیستی", "خانه و باغ", "سیاست و مسائل روز",
                                 "تفریحات و فرهنگ عامه", "ورزش و ورزشکاری", "آب و هوا و فصول", "کتاب‌ها و ادبیات",
                                 "محیط زیست و پایداری"]},
            "1_17": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": ["موسیقی", "تقویم", "هشدار", "آب‌وهوا", "پخش", "تاریخ و زمان", "آشپزی", "ایمیل",
                                 "بیرون‌بر", "اخبار", "پیشنهاد", "فهرست‌ها", "اجتماعی", "حمل‌ونقل", "عمومی",
                                 "پرسش و پاسخ", "صوتی", "اینترنت اشیاء"]},
            "1_18": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی احساس متن",
                "task_classes": ["شادی", "غم", "خشم", "انزجار", "ترس", "تعجب"]},
            "1_19": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "1_20": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن کاربر در مکالمه با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "1_21": {
                "task_prompt": "مسئله : دسته بندی , تشخیص لحن چت بات در مکالمه ی کاربر با چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "2_1": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن اول مکالمه ی کاربر با چت بات به همراه پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_2": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آیا متن دوم کلمات کلیدی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_3": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آیا متن دوم پاسخ متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_4": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم متفاوت در موضوع یکسان", "مفهوم کاملا متفاوت"]},
            "2_5": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم تا حدی متفاوت با جزئیات یکسان", "مفهوم متفاوت در موضوع یکسان",
                                 "مفهوم کاملا متفاوت"]},
            "2_6": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , نوع ارتباط معنایی متن دوم با متن اول چگونه است ؟",
                "task_classes": ["مشابه", "متضاد", "بی ارتباط"]},
            "2_7": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم بازنویسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_8": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , احساس رضایت از نظر متن دوم در متن اول چگونه است ؟",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "2_9": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی فارسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_10": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی عربی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_11": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , آيا متن دوم ترجمه ی انگلیسی متن اول است ؟",
                "task_classes": ["مثبت", "منفی"]},
            "2_12": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن دوم که یک موجودیت نامدار در متن اول است به کدام دسته تعلق دارد ؟",
                "task_classes": ["گروه‌های سیاسی", "اشخاص", "سازمان‌ها", "مکان‌ها", "رویدادها", "ملت‌ها"]},
            "2_13": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , متن دوم که یک موجودیت نامدار در متن اول است به کدام دسته تعلق دارد ؟",
                "task_classes": ["اشخاص", "سازمان‌ها", "مکان‌ها"]},
            "3_1": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_2": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم موضوعات استخراج شده ی متن اول است ؟",
                "task_classes": None},
            "3_3": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات به همراه پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": None},
            "3_4": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم کلمات کلیدی متن اول است ؟",
                "task_classes": None},
            "3_5": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم پاسخ متن اول است ؟",
                "task_classes": None},
            "3_6": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم شباهت معنایی با متن اول دارد ؟",
                "task_classes": None},
            "3_7": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_8": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم بازنویسی متن اول است ؟",
                "task_classes": None},
            "3_9": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی فارسی متن اول است ؟",
                "task_classes": None},
            "3_10": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی عربی متن اول است ؟",
                "task_classes": None},
            "3_11": {
                "task_prompt": "مسئله : تشخیص ارتباط , آيا متن دوم ترجمه ی انگلیسی متن اول است ؟",
                "task_classes": None},
            "3_12": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول یک مکالمه است. آیا متن دوم خلاصه ی متن اول است ؟",
                "task_classes": None},
            "3_13": {
                "task_prompt": "مسئله : تشخیص ارتباط , آیا متن دوم به متن اول مرتبط است ؟",
                "task_classes": None},
            "3_14": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول مکالمه ی کاربر با چت بات است. آیا متن دوم موضوع استخراج شده ی متن اول است ؟",
                "task_classes": None},
            "1_170": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": []},
            "1_190": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی"]},
            "3_30": {
                "task_prompt": "مسئله : تشخیص ارتباط , متن اول  پیام جدید کاربر است. آیا متن دوم که یک سوال و پاسخ است به متن اول مرتبط است ؟",
                "task_classes": None},
        }


task_prompt_dict_v4 = {
            "1_1": {"task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت",
                    "task_classes": ["عالی", "خوب", "متوسط", "بد", "خیلی بد"]},
            "1_2": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن کاربر",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_3": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_4": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عصبانیت",
                "task_classes": ["مثبت", "منفی"]},
            "1_5": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت",
                "task_classes": ["مثبت", "منفی"]},
            "1_6": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس صمیمیت",
                "task_classes": ["مثبت", "منفی"]},
            "1_7": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس ترس",
                "task_classes": ["مثبت", "منفی"]},
            "1_8": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس حسادت",
                "task_classes": ["مثبت", "منفی"]},
            "1_9": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس شگفتی",
                "task_classes": ["مثبت", "منفی"]},
            "1_10": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عشق",
                "task_classes": ["مثبت", "منفی"]},
            "1_11": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس غصه",
                "task_classes": ["مثبت", "منفی"]},
            "1_12": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس خوشحالی",
                "task_classes": ["مثبت", "منفی"]},
            "1_13": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن متن",
                "task_classes": ["عامیانه", "رسمی", "کودکانه", "ادبی"]},
            "1_14": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["بازی ویدیویی", "راهنمای خرید", "سلامت و زیبایی", "علم و تکنولوژی", "عمومی",
                                 "هنر و سینما", "کتاب و ادبیات"]},
            "1_15": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["پزشکی", "کشاورزی و منابع طبیعی", "فنی مهندسی",
                                 "علوم پایه", "علوم انسانی", "هنر و معماری", "علمی تخصصی", "دامپزشکی"]},
            "1_16": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["هنر و طراحی", "مسائل اجتماعی و فعال‌سازی", "الهام‌بخش و انگیزشی", "خودرو",
                                 "زیبایی و لوازم آرایشی", "غذا و آشپزی", "کسب و کار و مالی", "مد و سبک",
                                 "آموزش و یادگیری", "علم و کشف", "بازی", "فناوری و نوآوری", "مذهب و معنویت",
                                 "حیوانات خانگی و جانوران", "سفر و ماجراجویی", "خانواده و پرورش فرزند",
                                 "خنده‌دار و طنز", "سلامت و بهزیستی", "خانه و باغ", "سیاست و مسائل روز",
                                 "تفریحات و فرهنگ عامه", "ورزش و ورزشکاری", "آب و هوا و فصول", "کتاب‌ها و ادبیات",
                                 "محیط زیست و پایداری"]},
            "1_17": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["موسیقی", "تقویم", "هشدار", "آب‌وهوا", "پخش", "تاریخ و زمان", "آشپزی", "ایمیل",
                                 "بیرون‌بر", "اخبار", "پیشنهاد", "فهرست‌ها", "اجتماعی", "حمل‌ونقل", "عمومی",
                                 "پرسش و پاسخ", "صوتی", "اینترنت اشیاء"]},
            "1_18": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس متن",
                "task_classes": ["شادی", "غم", "خشم", "انزجار", "ترس", "تعجب"]},
            "1_19": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "1_20": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن کاربر",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "1_21": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "2_1": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل مرتبط بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_2": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل کلمات کلیدی بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_3": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل پاسخ بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_4": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل نوع ارتباط معنایی",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم متفاوت در موضوع یکسان", "مفهوم کاملا متفاوت"]},
            "2_5": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل نوع ارتباط معنایی",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم تا حدی متفاوت با جزئیات یکسان", "مفهوم متفاوت در موضوع یکسان",
                                 "مفهوم کاملا متفاوت"]},
            "2_6": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل نوع ارتباط معنایی",
                "task_classes": ["مشابه", "متضاد", "بی ارتباط"]},
            "2_7": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل بازنویسی بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_8": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل احساس رضایت از نظر متن دوم در متن اول",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "2_9": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل ترجمه بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_10": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل ترجمه بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_11": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل ترجمه بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_12": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل متن دوم به عنوان موجودیت نامدار در متن اول",
                "task_classes": ["گروه‌های سیاسی", "اشخاص", "سازمان‌ها", "مکان‌ها", "رویدادها", "ملت‌ها"]},
            "2_13": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل متن دوم به عنوان موجودیت نامدار در متن اول",
                "task_classes": ["اشخاص", "سازمان‌ها", "مکان‌ها"]},
            "3_1": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل خلاصه بودن",
                "task_classes": None},
            "3_2": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل موضوعات بودن",
                "task_classes": None},
            "3_3": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل مرتبط بودن",
                "task_classes": None},
            "3_4": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل کلمات کلیدی بودن",
                "task_classes": None},
            "3_5": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل پاسخ بودن",
                "task_classes": None},
            "3_6": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل شباهت معنایی داشتن",
                "task_classes": None},
            "3_7": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل خلاصه بودن",
                "task_classes": None},
            "3_8": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل بازنویسی بودن",
                "task_classes": None},
            "3_9": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل ترجمه بودن",
                "task_classes": None},
            "3_10": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل ترجمه بودن",
                "task_classes": None},
            "3_11": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل ترجمه بودن",
                "task_classes": None},
            "3_12": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل خلاصه بودن",
                "task_classes": None},
            "3_13": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل مرتبط بودن",
                "task_classes": None},
            "3_14": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل موضوع بودن",
                "task_classes": None},
            "1_170": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": []},
            "1_190": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی"]},
            "3_30": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل مرتبط بودن",
                "task_classes": None},
        }


task_prompt_dict_v5 = {
            "1_1": {"task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت",
                    "task_classes": ["عالی", "خوب", "متوسط", "بد", "خیلی بد"]},
            "1_2": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن کاربر",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_3": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه", "لاتی", "عصبانی"]},
            "1_4": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عصبانیت",
                "task_classes": ["مثبت", "منفی"]},
            "1_5": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت",
                "task_classes": ["مثبت", "منفی"]},
            "1_6": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس صمیمیت",
                "task_classes": ["مثبت", "منفی"]},
            "1_7": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس ترس",
                "task_classes": ["مثبت", "منفی"]},
            "1_8": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس حسادت",
                "task_classes": ["مثبت", "منفی"]},
            "1_9": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس شگفتی",
                "task_classes": ["مثبت", "منفی"]},
            "1_10": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس عشق",
                "task_classes": ["مثبت", "منفی"]},
            "1_11": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس غصه",
                "task_classes": ["مثبت", "منفی"]},
            "1_12": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس خوشحالی",
                "task_classes": ["مثبت", "منفی"]},
            "1_13": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن متن",
                "task_classes": ["عامیانه", "رسمی", "کودکانه", "ادبی"]},
            "1_14": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["بازی ویدیویی", "راهنمای خرید", "سلامت و زیبایی", "علم و تکنولوژی", "عمومی",
                                 "هنر و سینما", "کتاب و ادبیات"]},
            "1_15": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["پزشکی", "کشاورزی و منابع طبیعی", "فنی مهندسی",
                                 "علوم پایه", "علوم انسانی", "هنر و معماری", "علمی تخصصی", "دامپزشکی"]},
            "1_16": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["هنر و طراحی", "مسائل اجتماعی و فعال‌سازی", "الهام‌بخش و انگیزشی", "خودرو",
                                 "زیبایی و لوازم آرایشی", "غذا و آشپزی", "کسب و کار و مالی", "مد و سبک",
                                 "آموزش و یادگیری", "علم و کشف", "بازی", "فناوری و نوآوری", "مذهب و معنویت",
                                 "حیوانات خانگی و جانوران", "سفر و ماجراجویی", "خانواده و پرورش فرزند",
                                 "خنده‌دار و طنز", "سلامت و بهزیستی", "خانه و باغ", "سیاست و مسائل روز",
                                 "تفریحات و فرهنگ عامه", "ورزش و ورزشکاری", "آب و هوا و فصول", "کتاب‌ها و ادبیات",
                                 "محیط زیست و پایداری"]},
            "1_17": {
                "task_prompt": "مسئله : دسته بندی , تحلیل موضوعی متن",
                "task_classes": ["موسیقی", "تقویم", "هشدار", "آب‌وهوا", "پخش", "تاریخ و زمان", "آشپزی", "ایمیل",
                                 "بیرون‌بر", "اخبار", "پیشنهاد", "فهرست‌ها", "اجتماعی", "حمل‌ونقل", "عمومی",
                                 "پرسش و پاسخ", "صوتی", "اینترنت اشیاء"]},
            "1_18": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس متن",
                "task_classes": ["شادی", "غم", "خشم", "انزجار", "ترس", "تعجب"]},
            "1_19": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "1_20": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن کاربر",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "1_21": {
                "task_prompt": "مسئله : دسته بندی , تحلیل لحن چت بات",
                "task_classes": ["رسمی", "عامیانه", "کودکانه"]},
            "2_1": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل مرتبط بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_2": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل کلمات کلیدی بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_3": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل پاسخ بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_4": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل نوع ارتباط معنایی",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم متفاوت در موضوع یکسان", "مفهوم کاملا متفاوت"]},
            "2_5": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل نوع ارتباط معنایی",
                "task_classes": ["مفهوم کاملا یکسان", "مفهوم تقریبا یکسان", "مفهوم تا حدی یکسان",
                                 "مفهوم تا حدی متفاوت با جزئیات یکسان", "مفهوم متفاوت در موضوع یکسان",
                                 "مفهوم کاملا متفاوت"]},
            "2_6": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل نوع ارتباط معنایی",
                "task_classes": ["مشابه", "متضاد", "بی ارتباط"]},
            "2_7": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل بازنویسی بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_8": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل احساس رضایت از نظر متن دوم در متن اول",
                "task_classes": ["مثبت", "منفی", "خنثی"]},
            "2_9": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل ترجمه بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_10": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل ترجمه بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_11": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل ترجمه بودن",
                "task_classes": ["مثبت", "منفی"]},
            "2_12": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل متن دوم به عنوان موجودیت نامدار در متن اول",
                "task_classes": ["گروه‌های سیاسی", "اشخاص", "سازمان‌ها", "مکان‌ها", "رویدادها", "ملت‌ها"]},
            "2_13": {
                "task_prompt": "مسئله : دسته بندی با دو ورودی , تحلیل متن دوم به عنوان موجودیت نامدار در متن اول",
                "task_classes": ["اشخاص", "سازمان‌ها", "مکان‌ها"]},
            "3_1": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل خلاصه بودن",
                "task_classes": None},
            "3_2": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل موضوعات بودن",
                "task_classes": None},
            "3_3": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل مرتبط بودن",
                "task_classes": None},
            "3_4": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل کلمات کلیدی بودن",
                "task_classes": None},
            "3_5": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل پاسخ بودن",
                "task_classes": None},
            "3_6": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل شباهت معنایی داشتن",
                "task_classes": None},
            "3_7": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل خلاصه بودن",
                "task_classes": None},
            "3_8": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل بازنویسی بودن",
                "task_classes": None},
            "3_9": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل ترجمه بودن",
                "task_classes": None},
            "3_10": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل ترجمه بودن",
                "task_classes": None},
            "3_11": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل ترجمه بودن",
                "task_classes": None},
            "3_12": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل خلاصه بودن",
                "task_classes": None},
            "3_13": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل مرتبط بودن",
                "task_classes": None},
            "3_14": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل موضوع بودن",
                "task_classes": None},
            "1_170": {
                "task_prompt": "مسئله : دسته بندی , دسته بندی موضوعی متن",
                "task_classes": []},
            "1_190": {
                "task_prompt": "مسئله : دسته بندی , تحلیل احساس رضایت متن",
                "task_classes": ["مثبت", "منفی"]},
            "3_30": {
                "task_prompt": "مسئله : تشخیص ارتباط , تحلیل مرتبط بودن",
                "task_classes": None},
        }



def preprocess_sample(sample, dataset_name, prompt_type, model_name, sub):
    # version 1 
    if model_name.split('/')[-1].strip() in ['retrieval_2_9neg_instruct_stage3_v2', 
                                             'retrieval_2_9neg_instruct_stage3_with_inbatch_v2',
                                             'retro_9neg_instruct_stage3_v2',
                                             'retro_9neg_instruct_stage3_with_inbatch_v2']:
        # print("\nModel is Version 1\n")
        processed_sample = preprocess_sample_hard(sample, dataset_name, prompt_type, task_prompt_dict_v1, dataset_info_dict_1, sub)

    # version 2 
    elif model_name.split('/')[-1].strip() in ['retro_9neg_instruct_stage3_v2_v2_with_inbatch']:
        # print("\nModel is Version 2\n")
        processed_sample = preprocess_sample_hard(sample, dataset_name, prompt_type, task_prompt_dict_v2, dataset_info_dict_2, sub)

    # version 3 
    elif model_name.split('/')[-1].strip() in ['retro_9neg_instruct_stage3_v2_v3_with_inbatch']:
        # print("\nModel is Version 3\n")
        processed_sample = preprocess_sample_easy(sample, dataset_name, prompt_type, task_prompt_dict_v3, dataset_info_dict_2, sub)

    # version 4 
    elif model_name.split('/')[-1].strip() in ['bge_9neg_instruct_stage3_v2_v4_no_inbatch',
                                             'retro_9neg_instruct_stage3_v2_v4_no_inbatch',
                                             'retro_9neg_instruct_stage3_v2_v4_with_inbatch',
                                             'bge_9neg_instruct_stage3_v2_v4_with_inbatch',
                                             'bge_balanced_9neg_instruct_stage3_v2_v4_with_inbatch',
                                             'bge_unbalanced_9neg_instruct_stage3_v2_v4_with_inbatch',
                                             'retro_7neg_filtered_retrieval_2_farsi']:
        # print("\nModel is Version 4\n")
        processed_sample = preprocess_sample_easy(sample, dataset_name, prompt_type, task_prompt_dict_v4, dataset_info_dict_2, sub)

    # version 5 
    elif model_name.split('/')[-1].strip() in ['retro_9neg_instruct_stage3_v2_v5_with_inbatch']:
        # print("\nModel is Version 5\n")
        processed_sample = preprocess_sample_easy(sample, dataset_name, prompt_type, task_prompt_dict_v5, dataset_info_dict_2, sub)

    else:
        raise Exception("Sorry, should be one of above")

    return processed_sample

def preprocess_sample_hard(sample, dataset_name, prompt_type, task_prompt_dict, dataset_info_dict, sub):
    dataset_info = dataset_info_dict[dataset_name]
    task_id = dataset_info["task_id"]
    subtask_id = dataset_info["subtask_id"]
    if task_id != 4:
        task_key = str(task_id) + "_" + str(subtask_id)
        task_dict = task_prompt_dict[task_key]
        task_prompt = task_dict["task_prompt"]
        task_classes = task_dict["task_classes"]

    processed_sample = None
    if task_id == 1:
        processed_sample = task_prompt + " | " + "دسته ها : " + " , ".join(
            task_classes) + " | " + "متن : " + sample

    elif task_id == 2:
        processed_sample = task_prompt + " | " + "دسته ها : " + " , ".join(
            task_classes) + " | " + "متن اول : " + sample[0] + " | " + "متن دوم : " + sample[1]

    elif task_id == 3 and not sub:
        if prompt_type.value == 'query':
            processed_sample = task_prompt + " | " + "متن اول : " + sample
        elif prompt_type.value == 'passage':
            processed_sample = task_prompt + " | " + "متن دوم : " + sample
    elif task_id == 3 and  sub:
        if sub == 'sentence1':
            processed_sample = task_prompt + " | " + "متن اول : " + sample
        elif sub == 'sentence2':
            processed_sample = task_prompt + " | " + "متن دوم : " + sample
                                    
    elif task_id == 4:
        processed_sample = sample

    return processed_sample




def preprocess_sample_easy(sample, dataset_name, prompt_type, task_prompt_dict, dataset_info_dict, sub):

    dataset_info = dataset_info_dict[dataset_name]
    task_id = dataset_info["task_id"]
    subtask_id = dataset_info["subtask_id"]
    if task_id != 4:
        task_key = str(task_id) + "_" + str(subtask_id)
        task_dict = task_prompt_dict[task_key]
        task_prompt = task_dict["task_prompt"]

    processed_sample = None
    if task_id == 1:
        processed_sample = task_prompt + " | " + "متن : " + sample

    elif task_id == 2:
        processed_sample = task_prompt + " | " + "متن اول : " + sample[0] + " | " + "متن دوم : " + sample[1]

    elif task_id == 3 and not sub:
        if prompt_type.value == 'query':
            processed_sample = task_prompt + " | " + "متن اول : " + sample
        elif prompt_type.value == 'passage':
            processed_sample = task_prompt + " | " + "متن دوم : " + sample

    elif task_id == 3 and  sub:
        if sub == 'sentence1':
            processed_sample = task_prompt + " | " + "متن اول : " + sample
        elif sub == 'sentence2':
            processed_sample = task_prompt + " | " + "متن دوم : " + sample
                                    
    elif task_id == 4:
        processed_sample = sample



    return processed_sample

# if __name__ == '__main__':
#     sample = ['اااااااین متن رو از نظر احساسی بگو چیه؟؟؟؟']
#     instrction = preprocess_sample(sample, 'PersianTextEmotion')

#     print(instrction)